org_content/posts/20250114T125345==30e--wenzel2018-isabellejedit__phd_upm.org
# Created 2025-01-24 Fri 18:21
#+title: wenzel2018 - Isabelle/jedit
#+date: [2025-01-14 Tue 12:49]
#+author: Lucas Elvira Martín
#+HUGO_BUNDLE: /wenzel2018_isabellejedit
#+EXPORT_FILE_NAME: index
#+LANGUAGE: def
#+HUGO_BASE_DIR: ../../
* wenzel2018 - Isabelle/jedit

The paper talks about the integration between two open source tools. The first
one is used to support in theorem proofs and the second one is an text editor
wrote in Java. This integration allows users to check whether the content they
are reading or writing is valid in background. Also, the tools integrate parsers
for latex and markdown allowing the use of markup languages to render the
results.

In a first instance, Isabelle is designed to be used in mathematical theorem,
but the idea behind this could be extended to any implementation.
