content/posts/wenzel2018_isabellejedit/index.md
+++
title = "wenzel2018 - Isabelle/jedit"
author = ["Lucas Elvira Martín"]
date = 2025-01-14T12:49:00+01:00
draft = false
+++

## wenzel2018 - Isabelle/jedit {#wenzel2018-isabelle-jedit}

The paper talks about the integration between two open source tools. The first
one is used to support in theorem proofs and the second one is an text editor
wrote in Java. This integration allows users to check whether the content they
are reading or writing is valid in background. Also, the tools integrate parsers
for latex and markdown allowing the use of markup languages to render the
results.

In a first instance, Isabelle is designed to be used in mathematical theorem,
but the idea behind this could be extended to any implementation.
